src/cf/InformationRegisters/СостоянияCDNПлощадокМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СостоянияCDNПлощадокМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СреднееВремяПроверкиКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНедоступнаДоУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АдресПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПодключенияЛокальныхМодулейМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияЛокальныхМодулейМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерверПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПодключенияЛМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляИСМП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаОбменаЛокальногоМодуляМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКлючаСессииМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПараметраКлючаСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыТокеновАвторизацииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизацииМДЛП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МДЛП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГИСМТРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/РазрешительныйРежимМДЛП/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область НастройкиРазрешительногоРежима

// Возвращает сохраненные настройки разрешительного режима.
//
// Возвращаемое значение:
//  Результат - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежимаПоУмолчанию().
//
Функция НастройкиРазрешительногоРежима() Экспорт
	
	Результат = РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежимаПоУмолчанию();
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначениеКонстанты = Константы.НастройкиРазрешительногоРежимаМДЛП.Получить().Получить();
	
	Если ТипЗнч(ЗначениеКонстанты) = Тип("Структура") Или ТипЗнч(ЗначениеКонстанты) = Тип("ФиксированнаяСтруктура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ЗначениеКонстанты);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает новые настройки разрешительного режима.
//
// Параметры:
//  НовыеНастройки - Структура - новые настройки разрешительного режима.
//
Процедура УстановитьНастройкиРазрешительногоРежима(НовыеНастройки) Экспорт
	
	Настройки = РазрешительныйРежимМДЛПКлиентСервер.НастройкиРазрешительногоРежимаПоУмолчанию();
	
	ЗаполнитьЗначенияСвойств(Настройки, НовыеНастройки);
	
	ЗначениеКонстанты = Новый ХранилищеЗначения(Новый ФиксированнаяСтруктура(Настройки));
	
	Константы.НастройкиРазрешительногоРежимаМДЛП.Установить(ЗначениеКонстанты);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти // НастройкиРазрешительногоРежима

#Область МетодыИнтерфейсаРазрешительногоРежима

#Область ПроверкаКодаМаркировки

// Запускает проверку кодов маркировки в длительной операции.
//
// Параметры:
//  ПараметрыПроверкиКМНаСервере - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере.
//
// Возвращаемое значение:
//  ДлительнаяОперация - длительная операция выполнения проверки КМ.
//
Функция НачатьПроверкуКМНаСервере(ПараметрыПроверкиКМНаСервере) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ПараметрыПроверкиКМНаСервере.УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Фоновое получение идентификаторов запроса ГИС МТ при розничной продаже'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"РазрешительныйРежимМДЛП.ПроверитьКМНаСервереДлительнаяОперация",
		ПараметрыПроверкиКМНаСервере,
		ПараметрыВыполнения);
	
КонецФункции

// Длительная операция проверки кодов маркировки.
//
// Параметры:
//  ПараметрыПроверкиКМНаСервере - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере.
//  АдресРезультата - Строка - адрес временного хранилища, по которому будет помещен результат проверки КМ.
//
Процедура ПроверитьКМНаСервереДлительнаяОперация(ПараметрыПроверкиКМНаСервере, АдресРезультата) Экспорт
	
	РезультатПроверки = ПроверитьКМНаСервере(ПараметрыПроверкиКМНаСервере);
	
	ПоместитьВоВременноеХранилище(РезультатПроверки, АдресРезультата);
	
КонецПроцедуры

// Возвращает результат проверки кодов маркировки на сервере.
//
// Параметры:
//  ПараметрыПроверкиКМНаСервере - Структура - См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере.
//
// Возвращаемое значение:
//  РезультатПроверки - Структура - см. РазрешительныйРежимМДЛПКлиентСервер.НовыйРезультатПроверкиКМНаКлиентеНаСервере.
//
Функция ПроверитьКМНаСервере(Знач ПараметрыПроверкиКМНаСервере) Экспорт
	
	ПараметрыВыполненияПроверкиКМНаСервере = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыПроверкиКМНаКлиентеНаСервере();
	ЗаполнитьЗначенияСвойств(ПараметрыВыполненияПроверкиКМНаСервере, ПараметрыПроверкиКМНаСервере);
	
	Если ПараметрыВыполненияПроверкиКМНаСервере.ВыполнятьПроверкуНаТСПИоТ Тогда
		
		// Проверка на ТС ПИоТ.
		РезультатПроверкиНаТСПИоТ = ИнтеграцияТСПИоТМДЛПКлиентСервер.ПроверитьКМНаТСПИоТ(ПараметрыВыполненияПроверкиКМНаСервере);
		
		ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки = РезультатПроверкиНаТСПИоТ;
		// ор ++
		Если Не ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки.ЕстьОшибки
			И РезультатПроверкиНаТСПИоТ.КодыМаркировкиБезДанных <> Неопределено
			И РезультатПроверкиНаТСПИоТ.КодыМаркировкиБезДанных.Количество() > 0 Тогда
			// Проверка на Локальном модуле ЧЗ.
			РезультатПроверкиНаЛокальномМодуле = РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМНаЛокальномМодуле(ПараметрыВыполненияПроверкиКМНаСервере);
			РезультатПроверкиНаЛокальномМодуле.ПроверкаНаТСПИоТЗавершена = РезультатПроверкиНаТСПИоТ.ПроверкаНаТСПИоТЗавершена;
			ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки = РезультатПроверкиНаЛокальномМодуле;
		КонецЕсли;
		// ор --
		
		Возврат ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки;
		
	Иначе
		
		// Онлайн проверка.
		РезультатПроверкиОнлайн = РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМОнлайн(ПараметрыВыполненияПроверкиКМНаСервере);
		
		ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки = РезультатПроверкиОнлайн;
		
		Если ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки.ЕстьОшибки Тогда
			Возврат ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки;
		КонецЕсли;
		
		// Проверка на Локальном модуле ЧЗ.
		РезультатПроверкиНаЛокальномМодуле = РазрешительныйРежимМДЛПКлиентСервер.ПроверитьКМНаЛокальномМодуле(ПараметрыВыполненияПроверкиКМНаСервере);
		
		ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки = РезультатПроверкиНаЛокальномМодуле;
		
		Возврат ПараметрыВыполненияПроверкиКМНаСервере.РезультатПроверки;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти // ПроверкаКодаМаркировки

#Область CDNПлощадки

// Актуализация списка CDN-площадок для обращения в ГИС МТ методом розничной продажи.
// При своевременной актуализации списка гарантируется максимально быстрое получение идентификаторов
// разрешительного режима для ускорения розничной продажи.
//
// Параметры:
//  Организация - СправочникСсылка.ОрганизацииМДЛП - Организация.
//
// Возвращаемое значение:
//  Структура - результат обновления площадок:
//   * ТребуетсяОбновлениеКлючаСессииРозница - Булево - признак необходимости обновления ключа сессии.
//   * СписокПлощадок - Соответствие Из КлючИЗначение - полученные CDN-площадки:
//      ** Ключ     - Строка - адрес площадки.
//      ** Значение - Структура - замеры скорости CDN-площадок.
// * ТекстОшибки - Строка - текст ошибки, полученной от ГИС МТ.
//
Функция АктуализацияСпискаCDNПлощадок(Организация) Экспорт
	
	КлючСессии = ПроверитьОбновитьКлючСессии(РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница(Организация));
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ТребуетсяОбновлениеКлючаСессииРозница", КлючСессии = Неопределено);
	ВозвращаемоеЗначение.Вставить("СписокПлощадок",                        Новый Соответствие);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",                           "");
	
	Если ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница Тогда
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ЗаголовкиHTTP = Новый Соответствие;
	ЗаголовкиHTTP.Вставить("Content-Type"  , "application/json; charset=utf-8");
	ЗаголовкиHTTP.Вставить("Accept-Charset", "utf-8");
	ЗаголовкиHTTP.Вставить("X-API-KEY"     , КлючСессии);
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("GET");
	ДанныеЗапроса.АдресЗапроса = "api/v4/true-api/cdn/info";
	ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
	
	ПараметрыЗапросов = РазрешительныйРежимМДЛПКлиентСервер.ПараметрыОтправкиHTTPЗапросов(Истина, Истина);
	
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросов);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		// Не получен список площадок, таймаут или иные проблемы.
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОтправкиЗапроса.ТребуетсяАвторизация;
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	КодОтвета = ДанныеОтвета.Получить("code");
	Если КодОтвета <> 0 Тогда
		РезультатОтправкиЗапросаОшибка = ТранспортМДЛПКлиентСервер.РезультатВыполненияОперации();
		РезультатОтправкиЗапросаОшибка.Статус = "Ошибка";
		РезультатОтправкиЗапросаОшибка.ОписаниеОшибки = НСтр("ru = 'Получен неверный запрос. Код ответа - %1: %2'");
		РезультатОтправкиЗапросаОшибка.ОписаниеОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(РезультатОтправкиЗапросаОшибка.ОписаниеОшибки, КодОтвета, ДанныеОтвета.Получить("description"));
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата = 3;
	
	СписокПлощадок = ДанныеОтвета.Получить("hosts");
	
	ЗаголовкиHTTP.Вставить("Connection", "close");
	
	Для Каждого Площадка Из СписокПлощадок Цикл
		
		АдресПлощадки = Площадка.Получить("host");
		СтруктураАдреса = РегистрыСведений.СостоянияCDNПлощадокМДЛП.РазобратьАдресПлощадкиНаСерверИПорт(АдресПлощадки);
		
		ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("GET");
		ДанныеЗапроса.АдресЗапроса = "api/v4/true-api/cdn/health/check";
		ДанныеЗапроса.Заголовки = ЗаголовкиHTTP;
		
		ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
		ПараметрыПодключения.Адрес                = СтруктураАдреса.Сервер;
		ПараметрыПодключения.Порт                 = СтруктураАдреса.Порт;
		ПараметрыПодключения.ЗащищенноеСоединение = СтруктураАдреса.ЗащищенноеСоединение;
		
		ЗамерыПоПлощадке = Новый Массив;
		
		Для Индекс = 1 По КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата Цикл
			
			НачалоЗамеровУниверсальнаяДата = ТекущаяУниверсальнаяДатаВМиллисекундах();
			
			РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
			
			Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
				
				ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(АдресПлощадки + "/" + ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				
				Если РезультатОтправкиЗапроса.ТребуетсяАвторизация Тогда
					ВозвращаемоеЗначение.ТребуетсяОбновлениеКлючаСессииРозница = РезультатОтправкиЗапроса.ТребуетсяАвторизация;
					ВозвращаемоеЗначение.ТекстОшибки = ТекстОшибки;
					Возврат ВозвращаемоеЗначение;
				Иначе
					РазрешительныйРежимМДЛПКлиентСервер.ДополнитьТекстОшибки(ВозвращаемоеЗначение.ТекстОшибки, ТекстОшибки);
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
			ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Истина);
			
			Если ДанныеОтвета = Неопределено Тогда
				ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(АдресПлощадки + "/" + ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
				Прервать;
			КонецЕсли;
			
			СреднееВремяОбработкиКМ = ДанныеОтвета.Получить("avgTimeMs");
			Если Не ЗначениеЗаполнено(СреднееВремяОбработкиКМ) Тогда
				СреднееВремяОбработкиКМ = 0;
			КонецЕсли;
			
			ЗамерПоПлощадке = Новый Структура("НачалоЗамера, КонецЗамера, СреднееВремяОбработкиКМ", НачалоЗамеровУниверсальнаяДата, ТекущаяУниверсальнаяДатаВМиллисекундах(), СреднееВремяОбработкиКМ);
			
			ЗамерыПоПлощадке.Добавить(ЗамерПоПлощадке);
			
		КонецЦикла;
		
		СтруктураЗамеров = Новый Структура;
		СтруктураЗамеров.Вставить("СреднееВремяПроверкиКМ", 0);
		СтруктураЗамеров.Вставить("СреднееВремяОтвета",     0);
		
		Если ЗначениеЗаполнено(ЗамерыПоПлощадке) Тогда
			
			ОбщееВремяПроверкиКМ = 0;
			ОбщееВремяОтвета     = 0;
			
			Для Каждого ЗамерВремени Из ЗамерыПоПлощадке Цикл
				ОбщееВремяПроверкиКМ = ОбщееВремяПроверкиКМ + ЗамерВремени.СреднееВремяОбработкиКМ;
				ОбщееВремяОтвета     = ОбщееВремяОтвета + (ЗамерВремени.КонецЗамера - ЗамерВремени.НачалоЗамера);
			КонецЦикла;
			
			СтруктураЗамеров.СреднееВремяПроверкиКМ = ОбщееВремяПроверкиКМ / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
			СтруктураЗамеров.СреднееВремяОтвета     = ОбщееВремяОтвета / КоличествоЗапросовПоОднойПлощадкеДляУсредненияРезультата;
			
		Иначе
			
			// Ответа от площадок не получено, площадка получает минимальный рейтинг в списке.
			СтруктураЗамеров.СреднееВремяПроверкиКМ = -1;
			СтруктураЗамеров.СреднееВремяОтвета     = -1;
			
		КонецЕсли;
		
		ВозвращаемоеЗначение.СписокПлощадок.Вставить(АдресПлощадки, СтруктураЗамеров);
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // CDNПлощадки

#КонецОбласти // МетодыИнтерфейсаРазрешительногоРежима

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

// См. процедуры ОбновлениеИнформационнойБазыМДЛП.ПриДобавленииОбработчиковОбновления,
// ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РазрешительныйРежимМДЛП.НачальноеЗаполнение";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия              = "1.2.11.1";
	Обработчик.Процедура           = "РазрешительныйРежимМДЛП.УстановитьНастройкиРазрешительногоРежимаМДЛП";
	Обработчик.РежимВыполнения = "Монопольно";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "1.2.13.1";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("7def8dc0-a658-4dab-ba60-9f9d4957dc9a");
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Процедура = "РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ОбработатьДанныеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена";
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.НастройкиПодключенияЛокальныхМодулейМДЛП.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюЗаполнениеФорматаОбмена";
	Обработчик.ОчередьОтложеннойОбработки = 1;
	Обработчик.ПроцедураПроверки  = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.БлокируемыеОбъекты = "";
	Обработчик.ЧитаемыеОбъекты    = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП";
	Обработчик.ИзменяемыеОбъекты  = "РегистрСведений.НастройкиПодключенияЛокальныхМодулейМДЛП";
	Обработчик.Комментарий        = НСтр("ru = 'Заполнение формата обмена с ЛМ ЧЗ по умолчанию'");
	Обработчик.ПриоритетыВыполнения = ОбновлениеИнформационнойБазы.ПриоритетыВыполненияОбработчика();
	
КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура НачальноеЗаполнение() Экспорт
	
	УстановитьНастройкиРазрешительногоРежимаМДЛП(Истина);
	
КонецПроцедуры

Процедура УстановитьНастройкиРазрешительногоРежимаМДЛП(НачальноеЗаполнение = Ложь) Экспорт
	
	Настройки = НастройкиРазрешительногоРежима();
	
	Если Не НачальноеЗаполнение Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ОбщегоНазначенияИСМПВызовСервера.НастройкиСканированияКодовМаркировки());
	КонецЕсли;
	
	УстановитьНастройкиРазрешительногоРежима(Настройки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти // ОбновлениеИнформационнойБазы

#Область Авторизация

// Возвращает структуру данных ключа сессии обмена с ГИС МТ.
//
// Параметры:
// Возвращаемое значение:
//  Структура - Параметры ключа сессии:
//   * КлючСессии  - Строка - Ключ сессии.
//   * ДействуетДо - Дата   - Дата и время окончания действия ключа сессии.
//
Функция ПараметрыКлючаСессии() Экспорт
	
	ПараметрыКлючаСессии = Новый Структура;
	ПараметрыКлючаСессии.Вставить("ИНН",         "");
	ПараметрыКлючаСессии.Вставить("КлючСессии" , "");
	ПараметрыКлючаСессии.Вставить("ДействуетДо", Дата(1,1,1));
	
	Возврат ПараметрыКлючаСессии;
	
КонецФункции

// Возвращает ключ сессии для обмена с ГИС МТ.
//
// Параметры:
//  ПараметрыЗапроса             - См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница.
//  СрокДействия                 - Дата, Неопределено - Срок действия ключа сессии.
//  ОбновлятьКлючСессииНаСервере - Булево - Признак необходимости обновления ключа сессии на сервере.
//
// Возвращаемое значение:
//  Строка, Неопределено - Действующий ключ сессии для организации.
//
Функция ПроверитьОбновитьКлючСессии(ПараметрыЗапроса, Знач СрокДействия = Неопределено, ОбновлятьКлючСессииНаСервере = Истина) Экспорт
	
	КлючСессии = ТекущийКлючСессии(ПараметрыЗапроса, СрокДействия);
	
	ТребуетсяОбновлениеКлючаСессии = (КлючСессии = Неопределено);
	
	Если ТребуетсяОбновлениеКлючаСессии И ОбновитьКлючСессииНаСервере(ПараметрыЗапроса, ОбновлятьКлючСессииНаСервере) Тогда
		КлючСессии = ТекущийКлючСессии(ПараметрыЗапроса);
	КонецЕсли;
	
	Возврат КлючСессии;
	
КонецФункции

Функция ЗапроситьПараметрыАвторизации(ПараметрыЗапроса) Экспорт
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыАвторизации", Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",          "");
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("GET");
	ДанныеЗапроса.АдресЗапроса = ПараметрыЗапроса.АдресЗапросаПараметровАвторизации;
	ДанныеЗапроса.Заголовки.Вставить("Content-Type"  , "application/json; charset=utf-8");
	ДанныеЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	ДанныеЗапроса.Заголовки.Вставить("Cache-Control" , "no-cache");
	
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапроса);
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Ложь);
	
	Если ДанныеОтвета = Неопределено Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(ДанныеЗапроса.АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ПараметрыАвторизации = ПараметрыАвторизации();
	ПараметрыАвторизации.Идентификатор = ДанныеОтвета.uuid;
	ПараметрыАвторизации.Данные        = ДанныеОтвета.data;
	
	ВозвращаемоеЗначение.ПараметрыАвторизации = ПараметрыАвторизации;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьКлючиСессий(ПараметрыЗапросовПоОрганизациям) Экспорт
	
	ВозвращаемоеЗначение = Новый Соответствие;
	
	Для Каждого ПараметрыЗапросаПоОрганизации Из ПараметрыЗапросовПоОрганизациям Цикл
		
		РезультатЗапросаКлючаСессии = ЗапроситьКлючСессии(ПараметрыЗапросаПоОрганизации);
		
		Если РезультатЗапросаКлючаСессии.ПараметрыКлючаСессии <> Неопределено Тогда
			
			УстановитьКлючСессии(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса, РезультатЗапросаКлючаСессии.ПараметрыКлючаСессии);
			
			// Ключ сессии обновлен
			ВозвращаемоеЗначение.Вставить(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса.Организация, Истина);
			
		Иначе
			
			// Ключ сессии не обновлен
			ВозвращаемоеЗначение.Вставить(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса.Организация, РезультатЗапросаКлючаСессии.ТекстОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция СертификатыДляПодписанияНаСервере() Экспорт
	
	СертификатыДляПодписанияНаСервере = ОбщегоНазначенияИС.СертификатыДляПодписанияНаСервере();
	Если СертификатыДляПодписанияНаСервере <> Неопределено
		И СертификатыДляПодписанияНаСервере.Сертификаты.Количество() > 0 Тогда
		
		Организации = СертификатыДляПодписанияНаСервере.Сертификаты.Скопировать(, "Организация");
		Организации.Свернуть("Организация");
		
		Для Каждого ТекОрганизация Из Организации Цикл
			ОрганизацияМДЛП = ИнтеграцияМДЛПВызовСервера.ОрганизацияМДЛППоОрганизации(ТекОрганизация.Организация);
			Если ЗначениеЗаполнено(ОрганизацияМДЛП) Тогда
				Продолжить;
			КонецЕсли;
			
			СтрокаСертификата = СертификатыДляПодписанияНаСервере.Сертификаты.Найти(ТекОрганизация.Организация, "Организация");
			Если СтрокаСертификата <> Неопределено Тогда
				НоваяСтрока = СертификатыДляПодписанияНаСервере.Сертификаты.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСертификата);
				НоваяСтрока.Организация = ОрганизацияМДЛП;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат СертификатыДляПодписанияНаСервере;
	
КонецФункции

#КонецОбласти // Авторизация

#Область ДляВызоваИзДругихПодсистем

#Область ОбработчикиСобытийБСП

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ДанныеКлючаСессииГИСМТРозницаМДЛП", "РазрешительныйРежимМДЛП.УстановкаПараметровСеанса");
	Обработчики.Вставить("CDNПлощадкиСОшибкамиОбменаМДЛП"  , "РазрешительныйРежимМДЛП.УстановкаПараметровСеанса");
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = Метаданные.ПараметрыСеанса.ДанныеКлючаСессииГИСМТРозницаМДЛП.Имя Тогда
		
		ПараметрыСеанса.ДанныеКлючаСессииГИСМТРозницаМДЛП = Новый ХранилищеЗначения(Неопределено);
		
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
		
	ИначеЕсли ИмяПараметра = Метаданные.ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП.Имя Тогда
		
		ПараметрыСеанса.CDNПлощадкиСОшибкамиОбменаМДЛП = Новый ХранилищеЗначения(Новый Массив());
		
		Если ТипЗнч(УстановленныеПараметры) = Тип("Массив") Тогда
			УстановленныеПараметры.Добавить(ИмяПараметра);
		ИначеЕсли ТипЗнч(УстановленныеПараметры) = Тип("Структура") Тогда
			УстановленныеПараметры.Вставить(ИмяПараметра);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийБСП

#КонецОбласти // ДляВызоваИзДругихПодсистем

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

#Область Авторизация

// Возвращает структуру данных запроса авторизации
//
// Возвращаемое значение:
//  Структура - Параметры авторизации:
//  * Идентификатор        - Строка - Идентификатор запроса
//  * Данные               - Строка - Данные для подписания
//  * UnitedToken - Булево - Признак возможности получения единого токена
//  * ИНН                  - Строка - ИНН для подписания МЧД
//
Функция ПараметрыАвторизации()
	
	ПараметрыАвторизации = Новый Структура;
	ПараметрыАвторизации.Вставить("Идентификатор", "");
	ПараметрыАвторизации.Вставить("Данные"       , "");
	
	Возврат ПараметрыАвторизации;
	
КонецФункции

// Возвращает текущий ключ сессии для обмена с ГИС МТ.
//
// Параметры:
//  ПараметрыЗапроса - (См. РазрешительныйРежимМДЛПКлиентСервер.ПараметрыЗапросаКлючаСессииГИСМТРозница).
//  СрокДействия - Дата, Неопределено - Срок действия ключа сессии.
//
// Возвращаемое значение:
//  Строка, Неопределено - Действующий ключ сессии для организации.
//
Функция ТекущийКлючСессии(ПараметрыЗапроса, Знач СрокДействия = Неопределено)
	
	Попытка
		ДанныеКлючаСессии = ПараметрыСеанса[ПараметрыЗапроса.ИмяПараметраКлючаСессии].Получить();
	Исключение
		ДанныеКлючаСессии = Неопределено;
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(ДанныеКлючаСессии) Тогда
		ДанныеКлючаСессии = РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолучитьСохраненныеДанныеКлючаСессии(ПараметрыЗапроса.ИмяПараметраКлючаСессии);
	КонецЕсли;
	
	// Ключ сессии еще не установлен
	Если ДанныеКлючаСессии = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеКлючаСессииДляОрганизации = АктуальныеПараметрыКлючаСессии(ПараметрыЗапроса, ДанныеКлючаСессии, СрокДействия);
	
	Если ДанныеКлючаСессииДляОрганизации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	КлючСессии = ДанныеКлючаСессииДляОрганизации.КлючСессии;
	
	Если ДанныеКлючаСессииДляОрганизации.Свойство("ИНН")
		И Не ЗначениеЗаполнено(ПараметрыЗапроса.ИНН)
		И ЗначениеЗаполнено(ДанныеКлючаСессииДляОрганизации.ИНН) Тогда
		ПараметрыЗапроса.ИНН = ДанныеКлючаСессииДляОрганизации.ИНН;
	КонецЕсли;
	
	Возврат КлючСессии;
	
КонецФункции

Функция ОбновитьКлючСессииНаСервере(ПараметрыЗапроса, ОбновлятьКлючСессииНаСервере = Истина)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СохраненныеДанныеКлючаСессии = РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолучитьСохраненныеДанныеКлючаСессии(ПараметрыЗапроса.ИмяПараметраКлючаСессии);
	
	Если СохраненныеДанныеКлючаСессии <> Неопределено Тогда
		
		ПараметрыКлючаСессии = АктуальныеПараметрыКлючаСессии(ПараметрыЗапроса, СохраненныеДанныеКлючаСессии);
		
		Если ПараметрыКлючаСессии <> Неопределено Тогда
			
			УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии, Ложь);
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбновлятьКлючСессииНаСервере Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = СертификатыДляПодписанияНаСервере();
	Если СертификатыДляПодписанияНаСервере = Неопределено
		Или СертификатыДляПодписанияНаСервере.Сертификаты.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	РезультатЗапроса = ЗапроситьПараметрыАвторизации(ПараметрыЗапроса);
	Если РезультатЗапроса.ПараметрыАвторизации = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ПараметрыЗапроса.Организация = Неопределено Тогда
		СтрокаСертификата = СертификатыДляПодписанияНаСервере.Сертификаты[0];
	Иначе
		СтрокаСертификата = СертификатыДляПодписанияНаСервере.Сертификаты.Найти(ПараметрыЗапроса.Организация, "Организация");
	КонецЕсли;
	
	Если СтрокаСертификата <> Неопределено Тогда
		
		// Для авторизации требуется прикрепленная подпись
		ПараметрыCMS = ЭлектроннаяПодпись.ПараметрыCMS();
		ПараметрыCMS.Открепленная = Ложь;
		
		Если СертификатыДляПодписанияНаСервере.МенеджерКриптографии <> Неопределено Тогда
			СертификатыДляПодписанияНаСервере.МенеджерКриптографии.ПарольДоступаКЗакрытомуКлючу = СтрокаСертификата.Пароль;
		КонецЕсли;
		
		РезультатПодписания = Подписать(
			РезультатЗапроса.ПараметрыАвторизации.Данные,
			ПараметрыCMS,
			СтрокаСертификата.СертификатКриптографии,
			СертификатыДляПодписанияНаСервере.МенеджерКриптографии);
		
	КонецЕсли;
	
	Если СтрокаСертификата = Неопределено
		Или Не РезультатПодписания.Успех Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат ЗапроситьУстановитьКлючСессии(
			ПараметрыЗапроса,
			РезультатЗапроса.ПараметрыАвторизации,
			РезультатПодписания.Подпись).КлючСессииУстановлен;
		
	КонецЕсли;
	
КонецФункции

Функция АктуальныеПараметрыКлючаСессии(ПараметрыЗапроса, ДанныеКлючаСессии, СрокДействия = Неопределено)
	
	Если СрокДействия = Неопределено Тогда
		
		Таймаут      = 60;
		СрокДействия = ТекущаяУниверсальнаяДата() + Таймаут;
		
	КонецЕсли;
	
	Если ПараметрыЗапроса.Организация <> Неопределено Тогда
		
		ПараметрыКлючаСессии = ДанныеКлючаСессии.Получить(ПараметрыЗапроса.Организация);
		
		Если ПараметрыКлючаСессии = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Ключ сессии устарел
		Если ПараметрыЗапроса.ИмяПараметраКлючаСессии = РазрешительныйРежимМДЛПКлиентСервер.ИмяДанныхКлючаСессии(Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница) Тогда
			
			Если РазрешительныйРежимМДЛПКлиентСервер.ДатаДействияТокенаГИСМТРозница() <= СрокДействия Тогда
				Возврат Неопределено; 
			КонецЕсли;
			
		ИначеЕсли ПараметрыКлючаСессии.ДействуетДо <= СрокДействия Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	Иначе
		
		Для Каждого КлючИЗначение Из ДанныеКлючаСессии Цикл
			
			Если КлючИЗначение.Значение.ДействуетДо > СрокДействия Тогда
				
				ПараметрыКлючаСессии = КлючИЗначение.Значение;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ПараметрыКлючаСессии;
	
КонецФункции

Процедура УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии, ЗаписатьВРегистр = Истина) Экспорт // ор ++
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗаписатьВРегистр Тогда
		
		РегистрыСведений.ДанныеКлючаСессииМДЛП.УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии);
		
	Иначе
		
		Попытка
			ДанныеКлючаСессии = ПараметрыСеанса[ПараметрыЗапроса.ИмяПараметраКлючаСессии].Получить();
		Исключение
			ДанныеКлючаСессии = Неопределено;
		КонецПопытки;
		
		Если ДанныеКлючаСессии = Неопределено Тогда
			ДанныеКлючаСессии = Новый Соответствие;
		КонецЕсли;
		
		Если ПараметрыКлючаСессии.КлючСессии = "" Или ПараметрыКлючаСессии.ДействуетДо = Дата(1,1,1) Тогда
			ДанныеКлючаСессии.Удалить(ПараметрыЗапроса.Организация);
		Иначе
			ДанныеКлючаСессии.Вставить(ПараметрыЗапроса.Организация, ПараметрыКлючаСессии);
		КонецЕсли;
		
		СохраняемыеДанные = Новый ХранилищеЗначения(ДанныеКлючаСессии);
		
		ПараметрыСеанса[ПараметрыЗапроса.ИмяПараметраКлючаСессии] = СохраняемыеДанные;
		
	КонецЕсли;
	
КонецПроцедуры

Функция Подписать(ДанныеДляПодписания, ПараметрыCMS, СертификатКриптографии, МенеджерКриптографии)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("Успех");
	ВозвращаемоеЗначение.Вставить("Подпись");
	ВозвращаемоеЗначение.Вставить("ТекстОшибки");
	
	Попытка
		
		Подпись = ЭлектроннаяПодписьСлужебный.ПодписатьCMS(
			ДанныеДляПодписания,
			ПараметрыCMS,
			СертификатКриптографии, МенеджерКриптографии);
		
		ВозвращаемоеЗначение.Успех   = Истина;
		ВозвращаемоеЗначение.Подпись = Подпись;
		
	Исключение
		
		ВозвращаемоеЗначение.Успех       = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

Функция ЗапроситьУстановитьКлючСессии(ПараметрыЗапроса, ПараметрыАвторизации, Подпись)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("КлючСессииУстановлен", Ложь);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",          "");
	
	СвойстваПодписи = Новый Структура("Подпись", Подпись);
	
	ПараметрыЗапросаПоОрганизации = Новый Структура;
	ПараметрыЗапросаПоОрганизации.Вставить("ПараметрыЗапроса",     ПараметрыЗапроса);
	ПараметрыЗапросаПоОрганизации.Вставить("ПараметрыАвторизации", ПараметрыАвторизации);
	ПараметрыЗапросаПоОрганизации.Вставить("СвойстваПодписи",      СвойстваПодписи);
	
	РезультатЗапросаКлючаСессии = ЗапроситьКлючСессии(ПараметрыЗапросаПоОрганизации);
	Если РезультатЗапросаКлючаСессии.ПараметрыКлючаСессии <> Неопределено Тогда
		
		УстановитьКлючСессии(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса, РезультатЗапросаКлючаСессии.ПараметрыКлючаСессии);
		
		ВозвращаемоеЗначение.КлючСессииУстановлен = Истина;
		
		Возврат ВозвращаемоеЗначение;
		
	Иначе
		
		ВозвращаемоеЗначение.КлючСессииУстановлен = Ложь;
		ВозвращаемоеЗначение.ТекстОшибки          = РезультатЗапросаКлючаСессии.ТекстОшибки;
		
		Возврат ВозвращаемоеЗначение;
		
	КонецЕсли;
	
КонецФункции

Функция ЗапроситьКлючСессии(ПараметрыЗапросаПоОрганизации)
	
	ВозвращаемоеЗначение = Новый Структура;
	ВозвращаемоеЗначение.Вставить("ПараметрыКлючаСессии", Неопределено);
	ВозвращаемоеЗначение.Вставить("ТекстОшибки",          "");
	
	АдресЗапроса = ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса.АдресЗапросаКлючаСессии;
	
	ДанныеЗапроса = ТранспортМДЛПКлиентСервер.ДанныеHTTPЗапроса("POST");
	ДанныеЗапроса.АдресЗапроса = АдресЗапроса;
	
	ДанныеЗапроса.ТелоЗапроса = Новый Структура;
	ДанныеЗапроса.ТелоЗапроса.Вставить("data", ИнтеграцияМДЛПКлиентСервер.ДвоичныеДанныеBase64(ТранспортМДЛПАПИКлиентСервер.ПодписьИзСвойствПодписи(ПараметрыЗапросаПоОрганизации)));
	
	ИНН = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса, "ИНН");
	Если Не ЗначениеЗаполнено(ИНН) Тогда
		Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса, "Организация");
		Если ЗначениеЗаполнено(Организация) Тогда
			ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИНН) Тогда
		ДанныеЗапроса.ТелоЗапроса.Вставить("inn", ИНН);
	КонецЕсли;
	
	ДанныеЗапроса.Заголовки.Вставить("Content-Type"  , "application/json; charset=utf-8");
	ДанныеЗапроса.Заголовки.Вставить("Accept-Charset", "utf-8");
	
	ПараметрыПодключения = ТранспортМДЛПКлиентСервер.НовыеПараметрыОтправкиHTTPЗапросов();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса);
	
	ТипТокенаАвторизации = РазрешительныйРежимМДЛПКлиентСервер.ТипТокенаАвторизацииПоИмениДанныхКлючаСессии(ПараметрыЗапросаПоОрганизации.ПараметрыЗапроса.ИмяПараметраКлючаСессии);
	Если ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница Тогда
		ПараметрыПодключения.Адрес = РазрешительныйРежимМДЛПКлиентСервер.АдресСервера(Истина, Истина);
	КонецЕсли;
	
	РезультатОтправкиЗапроса = ТранспортМДЛПКлиентСервер.ВыполнитьHTTPЗапрос(ПараметрыПодключения, ДанныеЗапроса);
	
	Если РезультатОтправкиЗапроса.Статус = "Ошибка" Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	ДанныеОтвета = ТранспортМДЛПКлиентСервер.ПреобразоватьJSONВЗначение(РезультатОтправкиЗапроса.ОтветТранспортногоМодуля, Ложь);
	
	Если ДанныеОтвета = Неопределено Или Не ДанныеОтвета.Свойство("access_token") Тогда
		ВозвращаемоеЗначение.ТекстОшибки = РазрешительныйРежимМДЛПКлиентСервер.ТекстОшибкиПоРезультатуОтправкиЗапроса(АдресЗапроса, РезультатОтправкиЗапроса);
		Возврат ВозвращаемоеЗначение;
	КонецЕсли;
	
	Если ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизацииМДЛП.ГИСМТРозница Тогда
		КлючСессии  = ДанныеОтвета.access_token;
		ДействуетДо = ТекущаяУниверсальнаяДата() + ДанныеОтвета.expires_in;
	КонецЕсли;
	
	ПараметрыКлючаСессии = ПараметрыКлючаСессии();
	ПараметрыКлючаСессии.ИНН         = ИНН;
	ПараметрыКлючаСессии.КлючСессии  = КлючСессии;
	ПараметрыКлючаСессии.ДействуетДо = ДействуетДо;
	
	ВозвращаемоеЗначение.ПараметрыКлючаСессии = ПараметрыКлючаСессии;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

#КонецОбласти // Авторизация

#КонецОбласти // СлужебныеПроцедурыИФункции
